app/controllers/movies_controller.rb

    debugger

    if params[:sort_by] && params[:ratings]
      @movies = Movie.where("rating = '#{p_rat.join("' OR rating = '")}'").order(params[:sort_by])
      p_rat.each { |x| @ratings_hash[x] = true }
---
SELECT "movies".* FROM "movies" WHERE (rating = 'G') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date